[
  {
    "name": "Geolocating Internet Content",
    "role": "Information Technology Consultant",
    "location": "Online/Remote",
    "year": "2023, 2024",
    "duration": "2 months",
    "achievements": "developing a chrome plugin that sends web page info to a service in the cloud receiving suggestions for geographic locations mentioned on the page, developed a user interface for visualization of web content on the map, developed and deployed a secured web service for storing bookmarks and providing statistical data",
    "technologies": "Spring Boot, Hibernate, Lombok, MapStruct, Python, VueJS, SCSS, PostgreSQL, OpenLayers, GeoJSON, REST, Auth0"
  },
  {
    "name": "Geotracing Company Hardware",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2023",
    "duration": "3 months",
    "achievements": "developed a secured backend service capable of receiving, storing and sending data to clients. developed an user interface for visualizing existing and incoming data",
    "technologies": "VueJS, GoLang, REST, OpenAPI, PostgreSQL, SCSS, Git, WebSocket, Auth0, OpenLayers, GeoJSON, ORM"
  },
  {
    "name": "Commodity Prices API Integration",
    "role": "Information Technology Consultant",
    "location": "Online/Remote",
    "year": "2023",
    "duration": "2 months",
    "achievements": "lead the extraction and storage of historical data and created and deployed webservices for automated data retrieval and signaling for major changes, included an admin panel and several types of exports for different ML tools",
    "technologies": "Python, PostgreSQL, Java, Quarkus, Angular, Azure Cloud, API integration, SCSS, JSON, Docker"
  },
  {
    "name": "Gaming Administration Panel Optimization",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2022, 2023",
    "duration": "8 months",
    "achievements": "implemented new types of gaming rewards within the system, solved bugs and broken functionality in a legacy system, enhanced the functionality of an administration panel for a global gaming entity, focusing on marketing and bonus features. Collaborated across multiple repositories and effectively communicated with stakeholders across locations, incl. UK, USA and New Zealand",
    "technologies": "JSP, Java, Maven, npm, SSH, CSS, RabitMQ, DataDog, Lucidchart, Git"
  },
  {
    "name": "Traffic Engineering Solutions",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2022",
    "duration": "8 months",
    "achievements": "contributed significantly to a traffic engineering initiative, creating tools for traffic simulations and essential ETL jobs. Leveraged Java-based frameworks for applications, ensuring efficient operations and seamless integrations.",
    "technologies": "Java, Quarkus, XML, Spring Boot, MapStruct, Lombok, JUnit, Docker, Kubernetes, SUMO, WebSocket, GeoJSON"
  },
  {
    "name": "Sports Data to Wallet Integration",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2021",
    "duration": "9 months",
    "achievements": "provided integration for sports data into an existing wallet app, created a vital frontend library in Angular. Whilst working as an outsourcing contractor acted as a mentor to incoming developers and facilitated effective collaboration among diverse teams encompassing designers, product owners, architects, and QA specialists.",
    "technologies": "Angular, Java, JFrog, npm, SCSS, TypeScript, SonarQube, Figma, Lucidchart"
  },
  {
    "name": "Contractor Performance Evaluation System",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2020",
    "duration": "11 months",
    "achievements": "developed REST API and a tool for importing data from various preexisting xml files, implemented specific business logic, included fast search features, interacted with long-distance team from a successful global organization",
    "technologies": "Java, Spring Security, Spring Data, HATEOAS, REST, API, ElasticSearch, SpEL, JPQL, PDF, Azure DevOps, Git"
  },
  {
    "name": "Security Surveillance Backend and Middleware",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2019, 2020",
    "duration": "3 months",
    "achievements": "prepared a middleware service for communication between cloud based services and peripheral devices, also export to printable files",
    "technologies": "Java, MQTT, PDF, REST, API, OAuth, WebSocket, Git, PlantUML"
  },
  {
    "name": "Admin Panel for an Access Control System",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2018, 2019",
    "duration": "15 months",
    "achievements": "developed a standalone multiplatform user interface by given frontend and database designs and integrated it into an existing system thus providing a more modern solution to tens thousands of active users, also calculations on data and export to printable files",
    "technologies": "Spring Boot, JavaFX, Apache Maven, Lombok, Hibernate, MQTT, TLS, CSS, XML, PDF, PostgreSQL, Figma"
  },
  {
    "name": "Company Resource Allocation System",
    "role": "Full Stack Software Developer",
    "location": "Sofia, Bulgaria",
    "year": "2018",
    "duration": "5 months",
    "achievements": "developed a stable secured REST API for the means of the project, prepared build and deploy pipelines for all components of the system, prepared documentation and wrote automated tests",
    "technologies": "Spring Boot, Jenkins, Jira, Java, Docker, Nexus, SonarQube, SMTP, OAuth2, Git, TLS, JSON, REST, API, Hibernate, JPQL, ORM, Spring Security, SpEL, PostgreSQL, Apache Maven, JUnit, REST-Assured, Lombok"
  },
  {
    "name": "Educational Catalogue on Botanical Diversity",
    "role": "Information Technology Consultant",
    "location": "Online/Remote",
    "year": "2017",
    "duration": "3 months",
    "achievements": "solved the task of creating a webservice with admin panel and rest endpoints for import, CRUD, and export of data incl. images",
    "technologies": "Java, REST, API, ThymeLeaf, SQL, Apache Maven, CSS, CDN, XML"
  },
  {
    "name": "CMS for a Pizza Place",
    "role": "Information Technology Consultant",
    "location": "Gabrovo, Bulgaria",
    "year": "2015",
    "duration": "2 months",
    "achievements": "designed, prepared, tested the code and deployment configurations for the web pages that provide register/login functionality and enables employees, managers and clients to check on restaurant menu, current and past orders and prices",
    "technologies": "PHP, CSS, HTML, SQL, CodeIgniter, CDN"
  },
  {
    "name": "Electronic Door Lock Design",
    "role": "Information Technology Consultant",
    "location": "Gabrovo, Bulgaria",
    "year": "2014",
    "duration": "3 months",
    "achievements": "blueprints for programmable electronic device that uses numpad interface",
    "technologies": "LogicCircuit, PIC, MPLAB, C++"
  },
  {
    "name": "Encrypted P2P Messaging CLI",
    "role": "Information Technology Consultant",
    "location": "Sofia, Bulgaria",
    "year": "2013",
    "duration": "2 months",
    "achievements": "encrypted messaging between machines on the web",
    "technologies": "C++"
  },
  {
    "name": "Login and Registration for MMORPG",
    "role": "Information Technology Consultant",
    "location": "Gabrovo, Bulgaria",
    "year": "2009, 2010",
    "duration": "8 months",
    "achievements": "deployed several websites and servers (inc. databases) for online games",
    "technologies": "HTML, CSS, PHP, SQL, DNS, HTTP, TLS"
  }
]